InformationRegisters/ГруппыЭлементовЭлектронныхКурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ГруппыЭлементовЭлектронныхКурсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлектронныйКурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеКурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТеорияЭлектронныхКурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ТерминыЭлектронныхГлоссариев</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьТекстыЭлектронныхКурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеГлоссарии</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТестовыеВопросы</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеТесты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПубликацииЭлектронныхКурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПубликацииЭлектронныхКурсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПубликации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтруктураКурса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ресурсы</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЭлектронныйКурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеКурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИмпортированныеЭлементыЭлектронныхКурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИмпортированныеЭлементыЭлектронныхКурсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмпортированныйЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеКурсы</v8:Type>
						<v8:Type>cfg:CatalogRef.СодержаниеЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыЭлектронныхКурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыЭлектронныхКурсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Тест</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Учебник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слайдовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SCORM</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЭлектронныеКурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЭлектронныеКурсы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерРедакции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставщикиЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтартоваяСтраница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьТекстыЭлектронныхКурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФинальнаяСтраница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьТекстыЭлектронныхКурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СправочнаяИнформация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьТекстыЭлектронныхКурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Глоссарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеГлоссарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Презентация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецЭлектронногоКурса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецЭлектронногоКурса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЭлектронныеРесурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЭлектронныеРесурсы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставщикиЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SCO</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдинственныйЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыЭлектронныхРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РазработкаЭлектронныхКурсовСлужебныйВызовСервера/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ТипыЭлектронныхКурсов() Экспорт
	Возврат РазработкаЭлектронныхКурсовСлужебный.ТипыЭлектронныхКурсов();	
КонецФункции

// Порядок элементов

Процедура ПереместитьЭлемент(Направление, СсылкаНаЭлемент) Экспорт
	РазработкаЭлектронныхКурсовСлужебный.ПереместитьЭлемент(Направление, СсылкаНаЭлемент);
КонецПроцедуры

// Внешние программы

Функция ДвоичныеДанныеПрограммы(ИмяПрограммы) Экспорт
	Возврат РазработкаЭлектронныхКурсовСлужебный.ДвоичныеДанныеПрограммы(ИмяПрограммы)
КонецФункции

Функция СтруктураМанифеста(ЭлектронныйКурс, ДанныеКурса, ВыгруженныеЭлементы, ОписаниеТипаВсеСсылки) Экспорт
	
	СтруктураМанифеста = Новый Структура("UUID, Title, PackageDate, Hash, CourseModifiedDate, Elements, Files, ElementsFolders");
	СтруктураМанифеста.UUID = Строка(ЭлектронныйКурс.УникальныйИдентификатор());
	СтруктураМанифеста.Title = ДанныеКурса.Наименование;
	СтруктураМанифеста.PackageDate = РазработкаЭлектронныхКурсовСлужебный.ЗначениеРеквизитаЭлементаКурсаВСтруктуру(ТекущаяДатаСеанса(), ОписаниеТипаВсеСсылки);
	СтруктураМанифеста.CourseModifiedDate = РазработкаЭлектронныхКурсовСлужебный.ЗначениеРеквизитаЭлементаКурсаВСтруктуру(ДанныеКурса.ДатаИзменения, ОписаниеТипаВсеСсылки);
			
	СтруктураМанифеста.Elements = Новый Массив;
	СтруктураМанифеста.Files = Новый Массив;
	СтруктураМанифеста.ElementsFolders = Новый Массив;
			
	Хеш = Новый ХешированиеДанных(ХешФункция.CRC32);
	
	Для Каждого ВыгруженныйЭлемент Из ВыгруженныеЭлементы Цикл
		СтруктураМанифеста.Elements.Добавить(
			Новый Структура("Element", ВыгруженныйЭлемент.ОтносительныйПутьКФайлуЭлемента)
		);
		Хеш.ДобавитьФайл(ВыгруженныйЭлемент.ПутьКФайлуЭлемента);
		
		Если ВыгруженныйЭлемент.ЭтоФайл Тогда
			СтруктураМанифеста.Files.Добавить(
			Новый Структура("File, Element", ВыгруженныйЭлемент.ОтносительныйПутьКФайлу, ВыгруженныйЭлемент.ОтносительныйПутьКФайлуЭлемента)
			);
			Хеш.ДобавитьФайл(ВыгруженныйЭлемент.ПутьКФайлу);
		КонецЕсли;
		
		Если ВыгруженныйЭлемент.ЭтоГруппаДляХраненияЭлементов Тогда
			СтруктураМанифеста.ElementsFolders.Добавить(
				Новый Структура("Element", ВыгруженныйЭлемент.ОтносительныйПутьКФайлуЭлемента)
			);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураМанифеста.Hash = Хеш.ХешСумма;
	
	Возврат СтруктураМанифеста;
	
КонецФункции

Функция ДанныеКурса(ЭлектронныйКурс) Экспорт
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйКурс, "Наименование, ДатаИзменения, НомерРедакции, НомерВерсии, Тип");
	
КонецФункции

Функция ОписаниеТипаВсеСсылки() Экспорт
	
	Возврат ОбщегоНазначения.ОписаниеТипаВсеСсылки();
	
КонецФункции

Функция ВсеСсылкиЭлементаСправочника(Знач СсылкаНаЭлемент, Знач ПроверятьСуществованиеВБазе = Ложь, Знач СчитатьПомеченныеНаУдалениеОтсутствующими = Ложь, ИсключитьГиперссылки = Ложь) Экспорт
	
	Возврат РазработкаЭлектронныхКурсовСлужебный.ВсеСсылкиЭлементаСправочника(СсылкаНаЭлемент, ПроверятьСуществованиеВБазе, СчитатьПомеченныеНаУдалениеОтсутствующими, ИсключитьГиперссылки);
	
КонецФункции

Функция ЭлементКурсаВСтруктуру(Знач СсылкаНаЭлемент, Знач ОписаниеТипаВсеСсылки = Неопределено) Экспорт
	
	Возврат РазработкаЭлектронныхКурсовСлужебный.ЭлементКурсаВСтруктуру(СсылкаНаЭлемент, ОписаниеТипаВсеСсылки);
	
КонецФункции

Функция ДвоичныеДанныеФайла(СсылкаНаЭлементКурса) Экспорт
	
	Возврат РаботаСФайлами.ДвоичныеДанныеФайла(СсылкаНаЭлементКурса);
	
КонецФункции

Функция ВсеГруппыЭлектронногоКурса(ЭлектронныйКурс) Экспорт
	Возврат РегистрыСведений.ГруппыЭлементовЭлектронныхКурсов.ВсеГруппыЭлектронногоКурса(ЭлектронныйКурс);
КонецФункции

Функция ИдентификаторОбъектаМетаданных(ОписаниеОбъектаМетаданных) Экспорт
	Возврат Строка(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОписаниеОбъектаМетаданных).УникальныйИдентификатор())
КонецФункции

Функция ДанныеВJSON(СтруктураНастроек) Экспорт
	Возврат ЭлектронноеОбучениеСлужебный.ДанныеВJSON(СтруктураНастроек);
КонецФункции

Функция МанифестSCORMXDTO(ЭлектронныйКурс, ДанныеКурса, КороткийКодКурса, ПутьККаталогуЭлектронногоКурса) Экспорт
	
	МанифестSCORMXDTO     = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.imsglobal.org/xsd/imscp_v1p1", "manifestType"));
	МанифестSCORMXDTO.identifier = Строка(ЭлектронныйКурс.УникальныйИдентификатор());
	МанифестSCORMXDTO.version    = Строка(ДанныеКурса.НомерРедакции) + "." + Строка(ДанныеКурса.НомерВерсии);
	
	МетаданныеМанифестаSCORMXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.imsglobal.org/xsd/imscp_v1p1", "metadataType"));			
	МетаданныеМанифестаSCORMXDTO.schema = "ADL SCORM";
	МетаданныеМанифестаSCORMXDTO.schemaversion = "2004 4th Edition";
	
	МанифестSCORMXDTO.metadata = МетаданныеМанифестаSCORMXDTO;
	
	ОрганизацииSCORMXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.imsglobal.org/xsd/imscp_v1p1", "organizationsType"));
	ОрганизацииSCORMXDTO.default = "organization_" + КороткийКодКурса;
	
	ОрганизацияSCORMXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.imsglobal.org/xsd/imscp_v1p1", "organizationType"));			
	ОрганизацияSCORMXDTO.identifier = "organization_" + КороткийКодКурса;
	ОрганизацияSCORMXDTO.title = ДанныеКурса.Наименование;
	
	ОсновнойЭлементОрганизацииSCORM = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.imsglobal.org/xsd/imscp_v1p1", "itemType"));			
	ОсновнойЭлементОрганизацииSCORM.identifier = "item_" + КороткийКодКурса;
	ОсновнойЭлементОрганизацииSCORM.identifierref = "res_" + КороткийКодКурса;
	ОсновнойЭлементОрганизацииSCORM.title = ДанныеКурса.Наименование;
	// Не везде работает parameters = "?api=scorm", поэтому параметр не вставляем сюда, а указываем в href.
	
	ОрганизацияSCORMXDTO.item.Добавить(ОсновнойЭлементОрганизацииSCORM);
	ОрганизацииSCORMXDTO.organization.Добавить(ОрганизацияSCORMXDTO);			
	МанифестSCORMXDTO.organizations = ОрганизацииSCORMXDTO;
	
	РесурсыПакетаSCORM = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.imsglobal.org/xsd/imscp_v1p1", "resourcesType"));			
	ОсновнойРесурсПакетаSCORM = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.imsglobal.org/xsd/imscp_v1p1", "resourceType"));
	
	ОсновнойРесурсПакетаSCORM.identifier = "res_" + КороткийКодКурса;
	ОсновнойРесурсПакетаSCORM.type = "webcontent";
	ОсновнойРесурсПакетаSCORM.scormType = "sco";
	ОсновнойРесурсПакетаSCORM.href = "index.html?api=scorm";
	
	РесурсыПакетаSCORM.resource.Добавить(ОсновнойРесурсПакетаSCORM);
	
	ФайлРесурсаSCORMXDTOТип = ФабрикаXDTO.Тип("http://www.imsglobal.org/xsd/imscp_v1p1", "fileType");
	
	ФайлыКурса = ЭлектронноеОбучениеСлужебныйКлиентСервер.ИскатьФайлы(ПутьККаталогуЭлектронногоКурса, "*", Истина);
	
	Для каждого ФайлКурса Из ФайлыКурса Цикл
		
		Если ФайлКурса.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		
		ОтносительныйПутьКФайлу = Сред(ФайлКурса.ПолноеИмя, СтрДлина(ПутьККаталогуЭлектронногоКурса)+1);
		ОтносительныйПутьКФайлу = СтрЗаменить(ОтносительныйПутьКФайлу, "\", "/");
		ФайлРесурсаSCORMXDTO = ФабрикаXDTO.Создать(ФайлРесурсаSCORMXDTOТип);
		ФайлРесурсаSCORMXDTO.href = ОтносительныйПутьКФайлу;
		ОсновнойРесурсПакетаSCORM.file.Добавить(ФайлРесурсаSCORMXDTO);
		
	КонецЦикла;
	
	МанифестSCORMXDTO.resources = РесурсыПакетаSCORM;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, МанифестSCORMXDTO, , , , НазначениеТипаXML.Явное);

	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

Процедура УдалитьВсеЭлементыКурса(ЭлектронныйКурс) Экспорт
	
	Если ЭлектронноеОбучениеСлужебный.СсылкаСуществуетВБазе(ЭлектронныйКурс) Тогда
		
		// Удаляем публикацию
		РегистрыСведений.ПубликацииЭлектронныхКурсов.УдалитьПубликацию(ЭлектронныйКурс);
			
		// Подчиненные элементы
			
		Справочники.ЭлектронныеКурсы.УстановитьСнятьПометкуУдаленияПодчиненныхЭлементов(ЭлектронныйКурс, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьДанныеЭлементаВБазу(СтруктураЭлемента) Экспорт
	
	СсылкаНаЭлемент = РазработкаЭлектронныхКурсовСлужебный.ЗначениеРеквизитаИзСтруктуры(СтруктураЭлемента.Ref);
	ИмяСправочника = ЭлектронноеОбучениеСлужебный.ИмяСправочникаПоСсылке(СсылкаНаЭлемент);
	РеквизитыИТЧ = РазработкаЭлектронныхКурсовСлужебныйПовтИсп.ВсеРеквизитыИТабличныеЧастиСправочника(ИмяСправочника);
	
	ЭтоГруппа = (СтруктураЭлемента.Свойство("IsFolder") И СтруктураЭлемента.IsFolder);
	
	Если ЭлектронноеОбучениеСлужебный.СсылкаСуществуетВБазе(СсылкаНаЭлемент) Тогда
		
		ЭлементОбъект = СсылкаНаЭлемент.ПолучитьОбъект();
		
	Иначе
		
		МенеджерЭлемента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(СсылкаНаЭлемент);
		
		Если ЭтоГруппа Тогда
			ЭлементОбъект = МенеджерЭлемента.СоздатьГруппу();
		Иначе					
			ЭлементОбъект = МенеджерЭлемента.СоздатьЭлемент();
		КонецЕсли;
		
		ЭлементОбъект.УстановитьСсылкуНового(СсылкаНаЭлемент);
		
	КонецЕсли;
	
	// Заполняем стандартные реквизиты
	
	Для каждого СтандартныйРеквизит Из РеквизитыИТЧ.СтандартныеРеквизиты Цикл
		
		УниверсальноеИмяСтандартногоРеквизита = РазработкаЭлектронныхКурсовСлужебный.ПеревестиСтандартныйРеквизит(СтандартныйРеквизит.Имя);
		
		Если УниверсальноеИмяСтандартногоРеквизита = "Ref" Тогда
			Продолжить;
		КонецЕсли;
		
		Если УниверсальноеИмяСтандартногоРеквизита = "IsFolder" Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтруктураЭлемента.Свойство(УниверсальноеИмяСтандартногоРеквизита) Тогда
			ЭлементОбъект[СтандартныйРеквизит.Имя] = РазработкаЭлектронныхКурсовСлужебный.ЗначениеРеквизитаИзСтруктуры(СтруктураЭлемента[УниверсальноеИмяСтандартногоРеквизита], СтандартныйРеквизит.Типы);
		КонецЕсли;
		
	КонецЦикла;
	
	// Заполняем реквизиты элемента
	
	Для каждого Реквизит Из РеквизитыИТЧ.Реквизиты Цикл
		
		Если ЭтоГруппа И НЕ Реквизит.ДоступенДляГруппы Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЭтоГруппа И НЕ Реквизит.ДоступенДляЭлемента Тогда
			Продолжить;
		КонецЕсли;				
		
		Если СтруктураЭлемента.Свойство(Реквизит.Имя) Тогда
			ЭлементОбъект[Реквизит.Имя] = РазработкаЭлектронныхКурсовСлужебный.ЗначениеРеквизитаИзСтруктуры(СтруктураЭлемента[Реквизит.Имя], Реквизит.Типы);
		КонецЕсли;
		
	КонецЦикла;
	
	// Заполняем табличные части элемента
	
	Для каждого ТабличнаяЧасть Из РеквизитыИТЧ.ТабличныеЧасти Цикл
		
		Если ЭтоГруппа И НЕ ТабличнаяЧасть.ДоступенДляГруппы Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЭтоГруппа И НЕ ТабличнаяЧасть.ДоступенДляЭлемента Тогда
			Продолжить;
		КонецЕсли;								
		
		Если СтруктураЭлемента.Свойство(ТабличнаяЧасть.Имя) Тогда
			
			ЭлементОбъект[ТабличнаяЧасть.Имя].Очистить(); // Обязательно
			
			Для каждого ЭлементТЧСтруктуры Из СтруктураЭлемента[ТабличнаяЧасть.Имя] Цикл
				
				НоваяСтрокаТЧ = ЭлементОбъект[ТабличнаяЧасть.Имя].Добавить();
				
				Для каждого Реквизит Из ТабличнаяЧасть.Реквизиты Цикл
					
					Если ЭлементТЧСтруктуры.Свойство(Реквизит.Имя) Тогда 
						НоваяСтрокаТЧ[Реквизит.Имя] = РазработкаЭлектронныхКурсовСлужебный.ЗначениеРеквизитаИзСтруктуры(ЭлементТЧСтруктуры[Реквизит.Имя], Реквизит.Типы);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;				
		
	КонецЦикла;
	
	// Учет особенностей
	
	Если ТипЗнч(ЭлементОбъект) = Тип("СправочникОбъект.ЭлектронныеКурсы")
		И НЕ ЭлектронноеОбучениеСлужебный.СсылкаСуществуетВБазе(ЭлементОбъект.Родитель) Тогда
		ЭлементОбъект.Родитель = Неопределено;
	КонецЕсли;
	
	// Сохраняем элемент
	
	ЭлементОбъект.ОбменДанными.Загрузка = Истина;
	ЭлементОбъект.Записать();			
	
	Если ЭлементОбъект.ПометкаУдаления Тогда
		ЭлементОбъект.УстановитьПометкуУдаления(Ложь, Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьДанныеФайлаВБазу(СтруктураЭлемента, АдресФайлаВоВременномХранилище) Экспорт
	
	ПрисоединенныйФайл = РазработкаЭлектронныхКурсовСлужебный.ЗначениеРеквизитаИзСтруктуры(СтруктураЭлемента.Ref);
	ВладелецФайла = РазработкаЭлектронныхКурсовСлужебный.ЗначениеРеквизитаИзСтруктуры(СтруктураЭлемента.ВладелецФайла);
	РасширениеБезТочки = СтруктураЭлемента.Расширение;
	ВремяИзмененияУниверсальное = РазработкаЭлектронныхКурсовСлужебный.ЗначениеРеквизитаИзСтруктуры(СтруктураЭлемента.ДатаМодификацииУниверсальная, Тип("Дата"));
	ИмяБезРасширения = СтруктураЭлемента.Description;
	
	// Обновляем двоичные данные
	
	Если ОбщегоНазначения.СсылкаСуществует(ПрисоединенныйФайл) Тогда
		
		СвойстваФайлаДляЗаписи = Новый Структура("АдресФайлаВоВременномХранилище, АдресВременногоХранилищаТекста, ИмяБезРасширения, ДатаМодификацииУниверсальная, Расширение");
		СвойстваФайлаДляЗаписи.АдресФайлаВоВременномХранилище = АдресФайлаВоВременномХранилище;
		СвойстваФайлаДляЗаписи.АдресВременногоХранилищаТекста = "";
		СвойстваФайлаДляЗаписи.ИмяБезРасширения = ИмяБезРасширения;
		СвойстваФайлаДляЗаписи.ДатаМодификацииУниверсальная = ВремяИзмененияУниверсальное;
		СвойстваФайлаДляЗаписи.Расширение = РасширениеБезТочки;				
		
		ПрисоединенныйФайлОбъект = ПрисоединенныйФайл.ПолучитьОбъект();
		ПрисоединенныйФайлОбъект.УстановитьПометкуУдаления(Ложь, Истина); // Так как перед загрузкой она была установлена
		
		РаботаСФайлами.ОбновитьФайл(
		ПрисоединенныйФайл,
		СвойстваФайлаДляЗаписи
		);
		
		
	Иначе
		
		СвойстваФайлаДляЗаписи = Новый Структура("Автор, ВладелецФайлов, ИмяБезРасширения, РасширениеБезТочки, ВремяИзмененияУниверсальное");
		СвойстваФайлаДляЗаписи.Автор = Пользователи.ТекущийПользователь();				
		СвойстваФайлаДляЗаписи.ВладелецФайлов = ВладелецФайла;
		СвойстваФайлаДляЗаписи.ИмяБезРасширения = ИмяБезРасширения;
		СвойстваФайлаДляЗаписи.РасширениеБезТочки = РасширениеБезТочки;
		СвойстваФайлаДляЗаписи.ВремяИзмененияУниверсальное = ВремяИзмененияУниверсальное;
		
		НовыйПрисоединенныйФайл = РаботаСФайлами.ДобавитьФайл(
		СвойстваФайлаДляЗаписи,
		АдресФайлаВоВременномХранилище,
		,
		,
		ПрисоединенныйФайл
		);
		
		Если НовыйПрисоединенныйФайл <> ПрисоединенныйФайл Тогда
			ВызватьИсключение НСтр("ru = 'Созданный файл имеет неправильный идентификатор'");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СохранитьГруппуХранения(СтруктураЭлемента, ЭлектронныйКурс) Экспорт
	
	СсылкаНаГруппуХранения = РазработкаЭлектронныхКурсовСлужебный.ЗначениеРеквизитаИзСтруктуры(СтруктураЭлемента.Ref);
	РегистрыСведений.ГруппыЭлементовЭлектронныхКурсов.СохранитьГруппуДляХраненияПодчиненныхЭлементов(ЭлектронныйКурс, СсылкаНаГруппуХранения);
	
КонецПроцедуры

Процедура ОпубликоватьКурс(ЭлектронныйКурс, ИдентификаторФормы) Экспорт
	
	Если ЭлектронноеОбучениеСлужебный.СсылкаСуществуетВБазе(ЭлектронныйКурс) Тогда 
		РегистрыСведений.ПубликацииЭлектронныхКурсов.Опубликовать(ЭлектронныйКурс, Истина, ИдентификаторФормы);
	Иначе
		ВызватьИсключение НСтр("ru = 'Электронный курс не был записан в базу'");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьСуществованиеСсылокВБазе(ЭлектронныйКурс) Экспорт
	
	ВсеСсылки = ВсеСсылкиЭлементаСправочника(ЭлектронныйКурс);
	
	Для каждого СсылкаНаЭлементВБазе Из ВсеСсылки Цикл
		
		Если НЕ ЭлектронноеОбучениеСлужебный.СсылкаСуществуетВБазе(СсылкаНаЭлементВБазе) Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Ссылка %1 типа %2 не найдена в базе'"), Строка(СсылкаНаЭлементВБазе.УникальныйИдентификатор()), Строка(ТипЗнч(СсылкаНаЭлементВБазе)));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗагрузитьВБазуПолныйПакет(СтруктураМанифеста, Элементы, Файлы, ГруппыЭлементов, ИдентификаторФормы) Экспорт
	
	ЭлектронныйКурс = Справочники.ЭлектронныеКурсы.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураМанифеста.UUID));
	
	НачатьТранзакцию();
	
	Попытка
	
		// Удаляем все элементы курса (если он существует в базе)
		//
		
		УдалитьВсеЭлементыКурса(ЭлектронныйКурс);
		
		// Загружаем курс
		//
			
		// Загружаем элементы курса
		
		Для каждого СвойстваЭлемента Из Элементы Цикл
			
			// Создаем новый элемент или получаем из базы
			
			ЗагрузитьДанныеЭлементаВБазу(СвойстваЭлемента);
			
		КонецЦикла;
		
		// Загружаем файлы курса
		
		Для каждого СвойстваФайла Из Файлы Цикл
			ЗагрузитьДанныеФайлаВБазу(СвойстваФайла.Свойства, СвойстваФайла.АдресВоВременномХранилище);
			
		КонецЦикла;
		
		// Загружаем группы хранения элементов
		
		Для каждого СвойстваГруппы Из ГруппыЭлементов Цикл
			
			// Сохраняем группу хранения
			СохранитьГруппуХранения(СвойстваГруппы, ЭлектронныйКурс);
			
		КонецЦикла;
			
		// Публикуем курс
		//
		ОпубликоватьКурс(ЭлектронныйКурс, ИдентификаторФормы);
		
		// Проверяем все ли ссылки существуют в базе
		//
		
		ПроверитьСуществованиеСсылокВБазе(ЭлектронныйКурс);
		
		// Завершаем
		//
		
		ЗафиксироватьТранзакцию();
	
	Исключение
 
 		ОтменитьТранзакцию();
		ЭлектронноеОбучениеСлужебный.ЗаписатьОшибкуВЖурналРегистрации(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;	
	
	Возврат ЭлектронныйКурс;
	
КонецФункции

Функция ЗагрузитьВБазуПакетSCORMИзХранилища(АдресХранилища, ИдентификаторФормы, СвойстваФайла, ВремяИзменения) Экспорт
	
	ДанныеXML = ПолучитьИзВременногоХранилища(АдресХранилища).ОткрытьПотокДляЧтения();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьПоток(ДанныеXML);
	
	МанифестТип  = ФабрикаXDTO.Тип("http://www.imsglobal.org/xsd/imscp_v1p1", "manifestType");
	МанифестSCORM = ФабрикаXDTO.Создать(МанифестТип);
	МанифестSCORM = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, МанифестТип);

	ЧтениеXML.Закрыть();
	
	Возврат ЗагрузитьВБазуПакетSCORM(МанифестSCORM, ИдентификаторФормы, СвойстваФайла, ВремяИзменения);
	
КонецФункции

Функция ЗагрузитьВБазуПакетSCORMИзФайла(ПутьКФайлуМанифеста, ИдентификаторФормы) Экспорт
	
	ФайлМанифеста = Новый Файл(ПутьКФайлуМанифеста);

	Если НЕ ФайлМанифеста.Существует() Тогда
		ВызватьИсключение  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Файл %1 не найден'"), ПутьКФайлуМанифеста);
	КонецЕсли;

	КаталогПакета = Новый Файл(ФайлМанифеста.Путь);

	// Читаем манифест
	//
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПутьКФайлуМанифеста);				

	МанифестТип  = ФабрикаXDTO.Тип("http://www.imsglobal.org/xsd/imscp_v1p1", "manifestType");
	МанифестSCORM = ФабрикаXDTO.Создать(МанифестТип);
	МанифестSCORM = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, МанифестТип);		

	ЧтениеXML.Закрыть();
	
	СписокФайлов = Новый Массив; // Линейный список файлов для последующего помещения в базу
	СтруктураФайлов = Новый Массив; // Массив файлов с учетом иерархии каталогов
	ОтсортированныеФайлы = Новый Массив; // Файлы на диске, которые надо загрузить
		
	ФайлыВКаталогеПакета = ЭлектронноеОбучениеСлужебныйКлиентСервер.ИскатьФайлы(КаталогПакета.ПолноеИмя, "*", Ложь);
		
	Для каждого ФайлПакетаВКорне Из ФайлыВКаталогеПакета Цикл		
		ОтсортированныеФайлы.Добавить(ФайлПакетаВКорне);					
	КонецЦикла;
		
	ЭлектронноеОбучениеСлужебныйКлиентСервер.СформироватьОписаниеФайлов(ОтсортированныеФайлы, СтруктураФайлов, СписокФайлов, Ложь, "");
	
	СвойстваФайла = РазработкаЭлектронныхКурсовСлужебныйКлиентСервер.ПустаяСтруктураСвойствЗагружаемогоФайла();				
	СвойстваФайла.Имя = КаталогПакета.Имя;
	СвойстваФайла.Расширение = "";
	СвойстваФайла.ЭтоКаталог = Истина;
	СвойстваФайла.Преобразовать = Ложь;
	СвойстваФайла.СтруктураФайлов = СтруктураФайлов;
	СвойстваФайла.СписокФайлов = СписокФайлов;
	
	Возврат ЗагрузитьВБазуПакетSCORM(МанифестSCORM, ИдентификаторФормы, СвойстваФайла, ФайлМанифеста.ПолучитьВремяИзменения());
	
КонецФункции

Функция ЗагрузитьВБазуПакетSCORM(МанифестSCORM, ИдентификаторФормы, СвойстваФайла, ВремяИзменения) Экспорт
	
	ИдентификаторПакетаSCORM = МанифестSCORM.identifier;
	Организация = МанифестSCORM.organizations.organization[0];	
		
	// Находим электронный курс
	//
	
	ЭлектронныйКурс = РегистрыСведений.ИмпортированныеЭлементыЭлектронныхКурсов.РанееИмпортированныйЭлемент(ИдентификаторПакетаSCORM, "organization", Организация.identifier);	
	
	НачатьТранзакцию();
	
	Попытка	
	
		// Удаляем все элементы курса (если он существует в базе)
		//
		
		Если ЭлектронноеОбучениеСлужебный.СсылкаСуществуетВБазе(ЭлектронныйКурс) Тогда
			
			// Удаляем публикацию
			
			РегистрыСведений.ПубликацииЭлектронныхКурсов.УдалитьПубликацию(ЭлектронныйКурс);
			
			// Подчиненные элементы
			
			Справочники.ЭлектронныеКурсы.УстановитьСнятьПометкуУдаленияПодчиненныхЭлементов(ЭлектронныйКурс, Истина);
			
		КонецЕсли;
		
		// Загружаем курс
		//
		
		// Создаем электронный курс
		
		Если ЭлектронноеОбучениеСлужебный.СсылкаСуществуетВБазе(ЭлектронныйКурс) Тогда
			ЭлектронныйКурсОбъект = ЭлектронныйКурс.ПолучитьОбъект();
			Если ЭлектронныйКурсОбъект.ПометкаУдаления Тогда
				ЭлектронныйКурсОбъект.УстановитьПометкуУдаления(Ложь, Ложь);
			КонецЕсли;			
		Иначе
			ЭлектронныйКурсОбъект = Справочники.ЭлектронныеКурсы.СоздатьЭлемент();
			РазработкаЭлектронныхКурсовСлужебный.УстановитьПредпочитаемогоПоставщика(ЭлектронныйКурсОбъект);
		КонецЕсли;
				
		ЭлектронныйКурсОбъект.Тип = Перечисления.ТипыЭлектронныхКурсов.SCORM;
		ЭлектронныйКурсОбъект.Наименование = Организация.title;
		ЭлектронныйКурсОбъект.ДополнительныеСвойства.Вставить("ДатаИзменения", ВремяИзменения);
		ЭлектронныйКурсОбъект.Записать();					
		
		ЭлектронныйКурс = ЭлектронныйКурсОбъект.Ссылка;
		
		РегистрыСведений.ИмпортированныеЭлементыЭлектронныхКурсов.ЗапомнитьИмпортЭлемента(ЭлектронныйКурс, ИдентификаторПакетаSCORM, "organization", Организация.identifier); 
		
		// Создаем один ресурс для всех файлов
		
		ЭлектронныйРесурс = РегистрыСведений.ИмпортированныеЭлементыЭлектронныхКурсов.РанееИмпортированныйЭлемент(ИдентификаторПакетаSCORM, "resources", "");
		
		Если ЭлектронноеОбучениеСлужебный.СсылкаСуществуетВБазе(ЭлектронныйРесурс) Тогда 
			ЭлектронныйРесурсОбъект = ЭлектронныйРесурс.ПолучитьОбъект();
			Если ЭлектронныйРесурсОбъект.ПометкаУдаления Тогда
				ЭлектронныйРесурсОбъект.УстановитьПометкуУдаления(Ложь, Ложь);
			КонецЕсли;			
		Иначе
			ЭлектронныйРесурсОбъект = Справочники.ЭлектронныеРесурсы.СоздатьЭлемент();
			РазработкаЭлектронныхКурсовСлужебный.УстановитьПредпочитаемогоПоставщика(ЭлектронныйКурсОбъект);
			ЭлектронныйРесурсОбъект.Родитель = Справочники.ЭлектронныеКурсы.ГруппаДляХраненияПодчиненныхЭлементов(ЭлектронныйКурс, Тип("СправочникСсылка.ЭлектронныеРесурсы"));			
		КонецЕсли;
		
		ЭлектронныйРесурсОбъект.SCO = Истина;
		ЭлектронныйРесурсОбъект.Наименование = ЭлектронныйКурсОбъект.Наименование;		
		ЭлектронныйРесурсОбъект.Записать();		
		ЭлектронныйРесурс = ЭлектронныйРесурсОбъект.Ссылка;
		
		РегистрыСведений.ИмпортированныеЭлементыЭлектронныхКурсов.ЗапомнитьИмпортЭлемента(ЭлектронныйРесурс, ИдентификаторПакетаSCORM, "resources", ""); 		
		
		// Помещаем в ресурс все файлы пакета		
		
		КаталогПакета = "";
		
		СвойстваВладельца = РазработкаЭлектронныхКурсовСлужебныйКлиентСервер.ПустаяСтруктураСвойствВладельцаЗагружаемыхФайлов();
		СвойстваВладельца.ИмяВладельцаФайлов = "НаборФайлов";
		СвойстваВладельца.ЭлектронныйКурс = ЭлектронныйКурс;
		СвойстваВладельца.НаборФайлов = ЭлектронныйРесурс;		
		СвойстваВладельца.ОбновлятьДатуРесурса = Ложь; // Дата ресурса всегда обновляется выше
		
		РазработкаЭлектронныхКурсовСлужебный.ПоместитьФайлВБазу(СвойстваФайла, СвойстваВладельца);
		
		// Формируем элементы содержания курса
		
		РазработкаЭлектронныхКурсовСлужебный.ИмпортироватьЭлементыОрганизацииКонтентаSCORM(ЭлектронныйКурс, ЭлектронныйРесурс, МанифестSCORM, Организация.item);
		
		// Публикуем курс
		//
		
		РегистрыСведений.ПубликацииЭлектронныхКурсов.Опубликовать(ЭлектронныйКурс, Истина, ИдентификаторФормы);
		
		// Проверяем все ли ссылки существуют в базе
		//
		
		ВсеСсылки = ВсеСсылкиЭлементаСправочника(ЭлектронныйКурс);
		
		Для каждого СсылкаНаЭлементВБазе Из ВсеСсылки Цикл
		
			Если НЕ ЭлектронноеОбучениеСлужебный.СсылкаСуществуетВБазе(СсылкаНаЭлементВБазе) Тогда
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Ссылка %1 типа %2 не найдена в базе'"), Строка(СсылкаНаЭлементВБазе.УникальныйИдентификатор()), Строка(ТипЗнч(СсылкаНаЭлементВБазе)));
			КонецЕсли;
		
		КонецЦикла;
		
		// Завершаем
		//
		
		ЗафиксироватьТранзакцию();
	
	Исключение

		ОтменитьТранзакцию();
		ЭлектронноеОбучениеСлужебный.ЗаписатьОшибкуВЖурналРегистрации(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;
	
	Возврат ЭлектронныйКурс;
	
КонецФункции

Функция МанифестSCORMДляЗагрузки(АдресХранилища) Экспорт
	
	ДанныеXML = ПолучитьИзВременногоХранилища(АдресХранилища).ОткрытьПотокДляЧтения();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьПоток(ДанныеXML);
	//ЧтениеXML.ОткрытьФайл(ПутьКФайлуМанифеста);

	МанифестТип  = ФабрикаXDTO.Тип("http://www.imsglobal.org/xsd/imscp_v1p1", "manifestType");
	МанифестSCORM = ФабрикаXDTO.Создать(МанифестТип);
	МанифестSCORM = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, МанифестТип);

	ЧтениеXML.Закрыть();
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, МанифестSCORM, , , , НазначениеТипаXML.Явное);

	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

Функция ВыгрузитьНаДиск(МассивЭлектронныхКурсов, ФорматВыгрузки) Экспорт
	
	Возврат РазработкаЭлектронныхКурсовСлужебный.ВыгрузитьНаДиск(МассивЭлектронныхКурсов, ФорматВыгрузки, "");
	
КонецФункции

#КонецОбласти
